In [6]:
%matplotlib inline
import pandas as pd
#import numpy as np

jupyter key to show method arguments
df = pd.DataFrame(@@@ SHIFT + TAB @@@)

In [8]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [9]:
#three components of a dataframe: the index, the column names/values and the data
df2 = pd.DataFrame({
        'A' : 1,
        'B' : pd.Timestamp('20171201'),
        'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
        'D' : np.array([3] * 4, dtype='int32'),
        'E' : pd.Categorical(['test', 'train', 'test', 'train']),
        'F' : 'foo'
    })
df2

   A          B    C  D      E    F
0  1 2017-12-01  1.0  3   test  foo
1  1 2017-12-01  1.0  3  train  foo
2  1 2017-12-01  1.0  3   test  foo
3  1 2017-12-01  1.0  3  train  foo

In [10]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df2.columns.values

array(['A', 'B', 'C', 'D', 'E', 'F'], dtype=object)

attributes
#df2.<tab>

In [13]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [14]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [15]:
df2.head()

   A          B    C  D      E    F
0  1 2017-12-01  1.0  3   test  foo
1  1 2017-12-01  1.0  3  train  foo
2  1 2017-12-01  1.0  3   test  foo
3  1 2017-12-01  1.0  3  train  foo

In [16]:
df2.tail(1)

   A          B    C  D      E    F
3  1 2017-12-01  1.0  3  train  foo

In [18]:
#Transpose
df2.T

,0,1,2,3
A,1,1,1,1
B,2017-12-01 00:00:00,2017-12-01 00:00:00,2017-12-01 00:00:00,2017-12-01 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [20]:
df = pd.DataFrame(np.random.randn(6,4), columns=list('ABCD'))
df

          A         B         C         D
0 -0.745803  0.308799 -0.257276 -1.219619
1 -1.318736 -0.691334 -1.484261 -1.369726
2 -1.521159 -0.023785 -0.989600  0.117365
3  1.506047  0.201790  0.073857  0.060878
4 -0.294890 -0.057676 -0.310954  0.792292
5  2.010300  0.280924 -1.001861 -0.529840

In [22]:
#Select portion of dataframe based on index values
df[1:3]

          A         B         C         D
1 -1.318736 -0.691334 -1.484261 -1.369726
2 -1.521159 -0.023785 -0.989600  0.117365

In [24]:
#value location
df.loc[df['B'] > 0]

          A         B         C         D
0 -0.745803  0.308799 -0.257276 -1.219619
3  1.506047  0.201790  0.073857  0.060878
5  2.010300  0.280924 -1.001861 -0.529840

In [26]:
#index location
df.iloc[3]

A    1.506047
B    0.201790
C    0.073857
D    0.060878
Name: 3, dtype: float64

In [27]:
# isin method to filter down a dataframe based on a list of keys

df2[df2['E'].isin(['test'])]

   A          B    C  D     E    F
0  1 2017-12-01  1.0  3  test  foo
2  1 2017-12-01  1.0  3  test  foo

In [31]:
#another way to filter a dataframe
df2[df2['E'] == 'test']

        A          B    C  D     E    F
0  sunday 2017-12-01  1.0  3  test  foo
2  sunday 2017-12-01  1.0  3  test  foo

In [49]:
data = [[1,3,5,np.nan,55,np.nan],[11,9,np.nan,np.nan,6,8],[88,np.nan,5,np.nan,6,6.9],[100,.03,15,2,8,'spam'],[np.nan,3,5,np.nan,6,8]]
df3 = pd.DataFrame(data,columns=list('abcdfg'))
df3

       a     b     c    d   f     g
0    1.0  3.00   5.0  NaN  55   NaN
1   11.0  9.00   NaN  NaN   6     8
2   88.0   NaN   5.0  NaN   6   6.9
3  100.0  0.03  15.0  2.0   8  spam
4    NaN  3.00   5.0  NaN   6     8

In [50]:
#MISSING DATA
pd.isnull(df3)

       a      b      c      d      f      g
0  False  False  False   True  False   True
1  False  False   True   True  False  False
2  False   True  False   True  False  False
3  False  False  False  False  False  False
4   True  False  False   True  False  False

In [51]:
#only show parts of the dataframe with null values
df3[pd.isnull(df3).any(axis=1)]

      a    b    c   d   f    g
0   1.0  3.0  5.0 NaN  55  NaN
1  11.0  9.0  NaN NaN   6    8
2  88.0  NaN  5.0 NaN   6  6.9
4   NaN  3.0  5.0 NaN   6    8

In [54]:
#eliminate any columns with null values
df3.dropna(how='any', axis=1)

    f
0  55
1   6
2   6
3   8
4   6

In [56]:
#eliminate any columns with null values
df3.dropna(how='any', axis=0)

       a     b     c    d  f     g
3  100.0  0.03  15.0  2.0  8  spam

In [58]:
#fill null values
df3.fillna(value=0)
df3.fillna(method='ffill')

       a     b     c    d   f     g
0    1.0  3.00   5.0  NaN  55   NaN
1   11.0  9.00   5.0  NaN   6     8
2   88.0  9.00   5.0  NaN   6   6.9
3  100.0  0.03  15.0  2.0   8  spam
4  100.0  3.00   5.0  2.0   6     8

    #APPEND

In [60]:
r = df3.iloc[3]
df3.append(r, ignore_index=True)

       a     b     c    d   f     g
0    1.0  3.00   5.0  NaN  55   NaN
1   11.0  9.00   NaN  NaN   6     8
2   88.0   NaN   5.0  NaN   6   6.9
3  100.0  0.03  15.0  2.0   8  spam
4    NaN  3.00   5.0  NaN   6     8
5  100.0  0.03  15.0  2.0   8  spam

In [62]:
#PIVOT
df4 = pd.DataFrame({
        'A' : ['AAPL', 'AAPL', 'BAML', 'CITI'] * 3,
        'B' : pd.date_range('20171201', periods = 12),
        'C' : np.random.randn(12),
        'D' : np.random.randn(12)
    })
df4

       A          B         C         D
0   AAPL 2017-12-01 -1.182693 -1.547819
1   AAPL 2017-12-02  1.444172 -0.271853
2   BAML 2017-12-03  1.301265 -0.749766
3   CITI 2017-12-04 -0.022550 -0.015116
4   AAPL 2017-12-05 -0.257842 -1.158233
5   AAPL 2017-12-06 -1.624715 -0.970338
6   BAML 2017-12-07  0.513302  1.871207
7   CITI 2017-12-08 -0.776297  1.467879
8   AAPL 2017-12-09  0.828062 -1.103540
9   AAPL 2017-12-10 -0.494456 -0.663977
10  BAML 2017-12-11  0.128330 -0.086704
11  CITI 2017-12-12 -0.195106 -0.654587

In [65]:
#pivot with a hierarchical index
pd.pivot_table(df4, values = 'D', index = ['A', 'B'])

A     B
AAPL  2017-12-01   -1.547819
      2017-12-02   -0.271853
      2017-12-05   -1.158233
      2017-12-06   -0.970338
      2017-12-09   -1.103540
      2017-12-10   -0.663977
BAML  2017-12-03   -0.749766
      2017-12-07    1.871207
      2017-12-11   -0.086704
CITI  2017-12-04   -0.015116
      2017-12-08    1.467879
      2017-12-12   -0.654587
Name: D, dtype: float64

In [67]:
#Pivot the table WITHOUT the hierarchical index
pd.pivot_table(df4, values = 'D', index = ['B'], columns=['A'], fill_value=0)

A               AAPL      BAML      CITI
B
2017-12-01 -1.547819  0.000000  0.000000
2017-12-02 -0.271853  0.000000  0.000000
2017-12-03  0.000000 -0.749766  0.000000
2017-12-04  0.000000  0.000000 -0.015116
2017-12-05 -1.158233  0.000000  0.000000
2017-12-06 -0.970338  0.000000  0.000000
2017-12-07  0.000000  1.871207  0.000000
2017-12-08  0.000000  0.000000  1.467879
2017-12-09 -1.103540  0.000000  0.000000
2017-12-10 -0.663977  0.000000  0.000000
2017-12-11  0.000000 -0.086704  0.000000
2017-12-12  0.000000  0.000000 -0.654587

In [68]:
#exact same code but without the fill_value  argument
pd.pivot_table(df4, values = 'D', index = ['B'], columns=['A'])

A               AAPL      BAML      CITI
B
2017-12-01 -1.547819       NaN       NaN
2017-12-02 -0.271853       NaN       NaN
2017-12-03       NaN -0.749766       NaN
2017-12-04       NaN       NaN -0.015116
2017-12-05 -1.158233       NaN       NaN
2017-12-06 -0.970338       NaN       NaN
2017-12-07       NaN  1.871207       NaN
2017-12-08       NaN       NaN  1.467879
2017-12-09 -1.103540       NaN       NaN
2017-12-10 -0.663977       NaN       NaN
2017-12-11       NaN -0.086704       NaN
2017-12-12       NaN       NaN -0.654587